[
  {
    "path": "posts/welcome/",
    "title": "Proposal",
    "description": "Our proposed steps and approach to tackle the Vast Challenge 2021 mini-challenges.",
    "author": [
      {
        "name": "Jiahui Lim, Linya Huang, Ying Zhang",
        "url": {}
      }
    ],
    "date": "2021-06-18",
    "categories": [],
    "contents": "\r\n\r\nContents\r\nProject Motivation\r\nProject Objectives\r\nDatasets\r\nProposed Scope and Methodology1. Data Preparation\r\n2. Understanding Historical News Reports and Microblog Data\r\n3. Storyboard & Visualizations for R Shiny\r\n4. Visualizing from combination of Texts and Geospatial\r\n\r\nProject Schedule and Plan\r\nSoftware tools & R packagesSoftware Tools:\r\nR Packages:\r\n\r\nReferences\r\n\r\nProject Motivation\r\n\r\nVAST Challenge 2021 - Mini Challenge 3\r\nStreaming online social media can be used to study crime detection problems. Combining geospatial information and suspicious social media post can help prevent and track the potential crimes, which has been widely used in many institutions. In this project, we will explore the microblogs data from 2021 IEEE VAST Challenge Mini-Challenge 3 to evaluate the risks to the public and recommend actions to local law enforcement. In addition, we plan to further analyze past events from historical news reports in Mini-Challenge 1 to determine frequent occurring locations that were subjected to chaos or accidents. This will allow us to better evaluate the risks of any incidents that might occur at those hotspots over time.\r\nProject Objectives\r\nVAST Challenge 2021 - OverviewFor this project, we will be using both text and visual analytics approach to analyze the available data and develop responses to the questions in VAST Challenge 2021 Mini-Challenge 3. We wish to understand ongoing incident text transcripts of emergency dispatches by the Abila, Kronos local police and fire departments, as well as local responses via the Micro blog. We will use interactive R Shiny dashboard to visualize real-time streaming social media data and geospatial data to make recommendations for further investigation.\r\nDatasets\r\nNo\r\nDataset\r\nInformation\r\n1\r\nAliba.shp\r\nAliba geospatial map file with geometry information including longitude, latitude and location names.\r\n2\r\ncsv-1700-1830, csv-1831-2000,  csv-2001-2131\r\nCall Center and Blog information during time period from 1700 to 2131 Abila time on January 23,2014, with 5 variables - date, author, message, hotspot location, latitude and longitude\r\n3\r\nNews Articles\r\nHistorical news reports on past events that consists of detailed documentation, timeline and location of events occurring.\r\nProposed Scope and Methodology\r\n\r\nOverview of Methodology\r\n1. Data Preparation\r\nAs the data (MC1 + MC3) given is unstructured, we will perform text pre-processing techniques to filter out and re-organize the textual data based on null values, manipulation of strings (lowercase, symbols, numbers), tokenization and stemming. This is to ensure all textual data are standardized for easier analysis.\r\nNext, as not all textual data given are useful, we will have to sieve those important ones out and discard the rest. As such, text classification methods will be used to label the blog posts and news articles if its (1) Junk or (2) Not Junk. From there, we will discard those labelled as (1) and focus on analyzing those with (2).\r\n2. Understanding Historical News Reports and Microblog Data\r\nFrom the classified information, we can first perform topic modeling techniques to understand what the top trending topics are generated from the data. These topics are words that can be in the form of unigram or bigrams. For each topic, we will also discover what are the top 10 words (or more) related to the topic. Then, we will move towards understanding the meaning of these words, aka sentiment analysis. The tokenized words will be classified by its sentiment; positive or negative. This will thus allow us to recognize words that might indicate danger.\r\nAdditionally, the topics and sentiment of words can be further analyzed using Exploratory Data Analysis (EDA) and Time-series Analysis. This will allow us to better comprehend how sentiment and topics changes over time, or when are these topics trending the most. Hence, it is very relevant as we will be able to detect certain patterns and better evaluate the risks levels for further actions by emergency dispatches. EDA and time-series can also help to highlight past events that occurred at certain areas, which we will be able to relate to real-time monitoring.\r\n3. Storyboard & Visualizations for R Shiny\r\nStoryboard 1Storyboard 2Storyboard 34. Visualizing from combination of Texts and Geospatial\r\nAs we wish to further visualize how the call center, microblog and historical news reports relate, our approach will be split into 2 parts: one for geospatial mapping with words and the other solely on text analysis.\r\nIn the first storyboard, we would like to determine how the hotspots’ location received by the call center are aligned with the top trending word(s) posted via social media (mapped using geospatial data). Filters will also be added to display the hotspots’ location and trending words during the selected sync-ed timeframe. From here, we can determine if the call received by the call center is (1) a false alarm or (2) an actual emergency happening.\r\nIn the second plot, we wish to analyze the authenticity, main topics and sentiment posted by each author. This will allow us to detect any weird activity as well as identify possible suspicious person. Text analytics techniques such as topic modeling (displaying about top 10 topics generated) as well as sentiment analysis (generated with word cloud) will be used to investigate the posts. Filters including author names as well as number of words to be shown will be added to facilitate the visualization.\r\nLastly, the third storyboard represents the exploratory and time-series analysis of the real-time topic words. We can also filter by time to show the depth of analysis, as well as filtering by authors. This will allow us to detect top trending topics based on the author and highlight any suspicious activity that can be flagged for the emergency dispatchers.\r\nProject Schedule and Plan\r\nPlanned TimelineThis is our overall plan towards working on the project and fulfilling the objectives stated.\r\nSoftware tools & R packages\r\nSoftware Tools:\r\nRStudio\r\nR Packages:\r\ndplyer\r\nggplot2\r\ntidyverse\r\nlubridate\r\ntopicmodels\r\ntidytext\r\nigraph\r\nleaflet\r\ntmap\r\nspdep\r\nrgeos\r\nsf\r\nsp\r\nReferences\r\nVAST Challenge 2021\r\nVisual Analytics Benchmark Repository\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-06-20T00:40:41+08:00",
    "input_file": {}
  }
]
